<a href="https://colab.research.google.com/github/yuanjinren/DS/blob/master/Pandas_filtering.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
url = 'https://drive.google.com/uc?export=download&id=1fL7KPyxgGYfQDsuJoBWHIWwCAf-HTFpX'
df = pd.read_csv(url)

In [0]:
df.head()

          game_event_id    player_name  ...     season_type  scoremargin_before_shot
game_id                                 ...
20900015              4  Stephen Curry  ...  Regular Season                      2.0
20900015             17  Stephen Curry  ...  Regular Season                      0.0
20900015             53  Stephen Curry  ...  Regular Season                     -4.0
20900015            141  Stephen Curry  ...  Regular Season                     -4.0
20900015            249  Stephen Curry  ...  Regular Season                      0.0

[5 rows x 19 columns]

In [92]:
df.nlargest(3,'shot_distance')

       game_id  game_event_id  ... First Name  Last Name
9113  41500313            304  ...        NaN        NaN
6184  21400571            218  ...        NaN        NaN
7958  21500438            277  ...        NaN        NaN

[3 rows x 22 columns]

In [94]:
df['shot_distance'].nlargest(10)

9113     83
6184     78
7958     71
9729     71
9918     71
10762    71
12797    71
1017     70
2945     70
8574     69
Name: shot_distance, dtype: int64

In [0]:
cond = (df['action_type']=='Jump Shot') | (df['action_type']=='Step Back Jump shot')

In [10]:
df.loc[cond, ('action_type','minutes_remaining')]

               action_type  minutes_remaining
0                Jump Shot                 11
1      Step Back Jump shot                  9
2                Jump Shot                  6
3                Jump Shot                  9
4                Jump Shot                  2
...                    ...                ...
13943            Jump Shot                  7
13944            Jump Shot                  7
13946            Jump Shot                  6
13955  Step Back Jump shot                  5
13957            Jump Shot                  2

[7589 rows x 2 columns]

In [0]:
list = ['Right Side Center(RC)', 'Left Side Center(LC)', 'Center(C)']

In [0]:
cond1 = df['shot_zone_area'].isin(list)

In [16]:
df.loc[cond1,('action_type','shot_zone_area')]

                      action_type         shot_zone_area
0                       Jump Shot  Right Side Center(RC)
1             Step Back Jump shot   Left Side Center(LC)
2                       Jump Shot              Center(C)
4                       Jump Shot   Left Side Center(LC)
5                       Jump Shot              Center(C)
...                           ...                    ...
13952   Running Pull-Up Jump Shot  Right Side Center(RC)
13953            Pullup Jump shot              Center(C)
13955         Step Back Jump shot   Left Side Center(LC)
13956  Driving Floating Jump Shot              Center(C)
13957                   Jump Shot   Left Side Center(LC)

[11497 rows x 2 columns]

In [20]:
cond2 = df['shot_zone_area'].str.contains('Center')
df.loc[cond2,'shot_zone_area']

0        Right Side Center(RC)
1         Left Side Center(LC)
2                    Center(C)
4         Left Side Center(LC)
5                    Center(C)
                 ...
13952    Right Side Center(RC)
13953                Center(C)
13955     Left Side Center(LC)
13956                Center(C)
13957     Left Side Center(LC)
Name: shot_zone_area, Length: 11497, dtype: object

In [21]:
cond2

0         True
1         True
2         True
3        False
4         True
         ...
13953     True
13954    False
13955     True
13956     True
13957     True
Name: shot_zone_area, Length: 13958, dtype: bool

In [0]:
htm_GSM = df.groupby('htm')

In [0]:
HOU =htm_GSM.get_group('HOU')

In [112]:
htm_GSM['minutes_remaining'].median().loc['ATL']

4

In [114]:
htm_GSM[['minutes_remaining','seconds_remaining']].agg(['median','mean'])

    minutes_remaining           seconds_remaining
               median      mean            median       mean
htm
ATL                 4  4.693750              29.0  28.225000
BKN                 4  4.150685              24.5  27.226027
BOS                 5  4.973510              29.0  28.900662
CHA                 4  4.549133              30.0  27.919075
CHI                 5  5.078014              28.0  27.716312
CLE                 5  4.900000              28.0  28.475000
DAL                 4  4.537594              27.0  27.996241
DEN                 5  5.184818              27.0  27.504950
DET                 5  5.290323              32.5  30.951613
GSW                 4  4.718527              29.0  28.738903
HOU                 4  4.711364              28.0  28.338636
IND                 4  4.899083              29.0  28.128440
LAC                 5  5.061538              28.0  29.387179
LAL                 5  4.992063              31.0  28.706349
MEM                 4  4.527066              28.0  27.079772
MIA                 4  4.451220              27.5  28.432927
MIL                 4  4.684211              25.0  26.451128
MIN                 4  4.103704              29.0  28.466667
NJN                 6  5.642857              30.0  26.928571
NOH                 5  4.958904              29.0  27.917808
NOP                 4  4.430657              32.0  29.496350
NYK                 5  5.118750              27.5  27.843750
OKC                 4  4.702006              31.0  29.994269
ORL                 4  4.500000              26.0  28.462963
PHI                 4  4.686047              31.0  30.238372
PHX                 5  5.071672              29.0  27.935154
POR                 5  4.802920              27.0  27.513382
SAC                 4  4.458599              27.0  27.455414
SAS                 4  4.623729              29.0  28.461017
TOR                 4  4.510753              27.0  27.139785
UTA                 5  5.057823              27.0  27.343537
WAS                 4  4.289617              29.0  28.934426

In [115]:
htm_GSM[['minutes_remaining','seconds_remaining']].agg(['median','mean']).loc['SAS']

minutes_remaining  median     4.000000
                   mean       4.623729
seconds_remaining  median    29.000000
                   mean      28.461017
Name: SAS, dtype: float64

In [107]:
htm_GSM['action_type'].value_counts().head(50)

htm  action_type
ATL  Jump Shot                          79
     Pullup Jump shot                   21
     Driving Layup Shot                 14
     Running Layup Shot                  6
     Cutting Layup Shot                  5
     Step Back Jump shot                 5
     Driving Reverse Layup Shot          4
     Running Jump Shot                   4
     Driving Jump shot                   3
     Fadeaway Jump Shot                  3
     Floating Jump shot                  3
     Running Pull-Up Jump Shot           3
     Driving Finger Roll Layup Shot      2
     Layup Shot                          2
     Dunk Shot                           1
     Pullup Bank shot                    1
     Running Finger Roll Layup Shot      1
     Running Reverse Layup Shot          1
     Tip Shot                            1
     Turnaround Jump Shot                1
BKN  Jump Shot                          81
     Pullup Jump shot                   19
     Driving Layup Shot                  7
     Floating Jump shot                  6
     Driving Floating Jump Shot          5
     Layup Shot                          5
     Running Layup Shot                  4
     Finger Roll Layup Shot              3
     Step Back Jump shot                 3
     Cutting Finger Roll Layup Shot      1
     Cutting Layup Shot                  1
     Driving Bank shot                   1
     Driving Finger Roll Layup Shot      1
     Driving Floating Bank Jump Shot     1
     Fadeaway Jump Shot                  1
     Reverse Layup Shot                  1
     Running Bank shot                   1
     Running Finger Roll Layup Shot      1
     Running Jump Shot                   1
     Step Back Bank Jump Shot            1
     Turnaround Fadeaway shot            1
     Turnaround Jump Shot                1
BOS  Jump Shot                          90
     Pullup Jump shot                   13
     Driving Finger Roll Layup Shot     10
     Layup Shot                          8
     Step Back Jump shot                 5
     Running Layup Shot                  4
     Floating Jump shot                  3
     Running Bank shot                   3
Name: action_type, dtype: int64

In [109]:
htm_GSM['action_type'].value_counts().loc['GSW']

action_type
Jump Shot                             2649
Pullup Jump shot                      1509
Step Back Jump shot                    613
Floating Jump shot                     308
Driving Layup Shot                     285
Driving Finger Roll Layup Shot         275
Layup Shot                             259
Driving Reverse Layup Shot             122
Running Jump Shot                      116
Turnaround Jump Shot                    81
Running Layup Shot                      60
Driving Floating Jump Shot              59
Jump Bank Shot                          57
Fadeaway Jump Shot                      53
Cutting Layup Shot                      52
Reverse Layup Shot                      48
Running Finger Roll Layup Shot          42
Running Bank shot                       40
Running Pull-Up Jump Shot               35
Running Reverse Layup Shot              25
Driving Floating Bank Jump Shot         23
Driving Bank shot                       22
Turnaround Fadeaway shot                20
Turnaround Bank shot                    17
Cutting Finger Roll Layup Shot          12
Pullup Bank shot                        11
Driving Jump shot                        9
Finger Roll Layup Shot                   9
Running Hook Shot                        8
Fadeaway Bank shot                       6
Hook Shot                                6
Driving Hook Shot                        5
Putback Layup Shot                       5
Slam Dunk Shot                           5
Driving Dunk Shot                        4
Running Dunk Shot                        4
Turnaround Fadeaway Bank Jump Shot       3
Turnaround Hook Shot                     3
Driving Slam Dunk Shot                   2
Jump Hook Shot                           2
Tip Layup Shot                           2
Tip Shot                                 2
Driving Bank Hook Shot                   1
No Shot                                  1
Turnaround Bank Hook Shot                1
Name: action_type, dtype: int64

In [101]:
df.drop(columns=['First Name', 'Last Name'],inplace=True)
df.head()

    game_id  game_event_id  ...     season_type  scoremargin_before_shot
0  20900015              4  ...  Regular Season                      2.0
1  20900015             17  ...  Regular Season                      0.0
2  20900015             53  ...  Regular Season                     -4.0
3  20900015            141  ...  Regular Season                     -4.0
4  20900015            249  ...  Regular Season                      0.0

[5 rows x 20 columns]

In [22]:
# change columns' names
student = {
    'student_ID': [1123451, 2341567,2349807],
    'student_name':['Steven','George','Jimmy'],
    'grade':['A','A+','B']
}

df_student=pd.DataFrame(student)
df_student

   student_ID student_name grade
0     1123451       Steven     A
1     2341567       George    A+
2     2349807        Jimmy     B

In [23]:
df_student.columns

Index(['student_ID', 'student_name', 'grade'], dtype='object')

In [25]:
df_student.columns = ['StudentID', 'StudentName', "Grade"]
df_student

   StudentID StudentName Grade
0    1123451      Steven     A
1    2341567      George    A+
2    2349807       Jimmy     B

In [27]:
# change column names into upper case letters
df_student.columns = [x.upper() for x in df_student.columns]
df_student

   STUDENTID STUDENTNAME GRADE
0    1123451      Steven     A
1    2341567      George    A+
2    2349807       Jimmy     B

In [28]:
df_student.columns

Index(['STUDENTID', 'STUDENTNAME', 'GRADE'], dtype='object')

In [0]:
df_student.columns = ['STUDENT ID', 'STUDENT NAME', 'GRADE ']

In [30]:
df_student.columns = df_student.columns.str.replace(' ','_')
df_student

   STUDENT_ID STUDENT_NAME GRADE_
0     1123451       Steven      A
1     2341567       George     A+
2     2349807        Jimmy      B

In [31]:
df_student.columns = [x.lower() for x in df_student.columns]
df_student

   student_id student_name grade_
0     1123451       Steven      A
1     2341567       George     A+
2     2349807        Jimmy      B

In [33]:
df_student.rename(columns={'student_id':'ID','student_name':'Name'},inplace=True)
df_student

        ID    Name grade_
0  1123451  Steven      A
1  2341567  George     A+
2  2349807   Jimmy      B

In [34]:
df_student.loc[2]

ID        2349807
Name        Jimmy
grade_          B
Name: 2, dtype: object

In [36]:
df_student.loc[2] = ['1273421', 'Gina', 'P']
df_student

        ID    Name grade_
0  1123451  Steven      A
1  2341567  George     A+
2  1273421    Gina      P

In [38]:
df_student.at[2, 'grade_'] = 'B'
df_student

        ID    Name grade_
0  1123451  Steven      A
1  2341567  George     A+
2  1273421    Gina      B

In [0]:
df_student['grade_'] = df_student['grade_'].str.lower()

In [40]:
df_student

        ID    Name grade_
0  1123451  Steven      a
1  2341567  George     a+
2  1273421    Gina      b

In [0]:
def update_name(name):
  return name.upper()

In [0]:
df_student['Name']=df_student['Name'].apply(update_name)

In [45]:
df_student

        ID    Name grade_
0  1123451  STEVEN      a
1  2341567  GEORGE     a+
2  1273421    GINA      b

In [0]:
df_student['Name']=df_student['Name'].apply(lambda x: x.lower())

In [47]:
df_student

        ID    Name grade_
0  1123451  steven      a
1  2341567  george     a+
2  1273421    gina      b

In [53]:
df_student['Name'].apply(len)

0    6
1    6
2    4
Name: Name, dtype: int64

In [0]:
df_student.rename(columns={'Name':'First Name'}, inplace=True)

In [57]:
df_student

        ID First Name grade_
0  1123451     steven      a
1  2341567     george     a+
2  1273421       gina      b

In [59]:
df_student['Last Name'] = ['Tim', 'King', 'Lucca']
df_student

        ID First Name grade_ Last Name
0  1123451     steven      a       Tim
1  2341567     george     a+      King
2  1273421       gina      b     Lucca

In [60]:
df_student['Full Name'] = df_student['First Name'] + ' ' + df_student['Last Name']
df_student

        ID First Name grade_ Last Name    Full Name
0  1123451     steven      a       Tim   steven Tim
1  2341567     george     a+      King  george King
2  1273421       gina      b     Lucca   gina Lucca

In [65]:
df_student.drop(columns=['First Name'],inplace=True)
df_student

        ID grade_    Full Name
0  1123451      a   steven Tim
1  2341567     a+  george King
2  1273421      b   gina Lucca

In [68]:
df_student[['First Name' ,'Last Name']]=df_student['Full Name'].str.split(' ', expand=True)
df_student

        ID grade_    Full Name First Name Last Name
0  1123451      a   steven Tim     steven       Tim
1  2341567     a+  george King     george      King
2  1273421      b   gina Lucca       gina     Lucca

In [69]:
# add one more row
df_student.append({'ID':'1234567'}, ignore_index=True)

        ID grade_    Full Name First Name Last Name
0  1123451      a   steven Tim     steven       Tim
1  2341567     a+  george King     george      King
2  1273421      b   gina Lucca       gina     Lucca
3  1234567    NaN          NaN        NaN       NaN

In [0]:
student2 = {
    'ID': [3688983, 3215467],
    'First Name':['Lisa','Key']
}

In [73]:
df_student2 = pd.DataFrame(student2)
df_student2

        ID First Name
0  3688983       Lisa
1  3215467        Key

In [76]:
df_student=df_student.append(df_student2,ignore_index=True)
df_student

        ID grade_    Full Name First Name Last Name
0  1123451      a   steven Tim     steven       Tim
1  2341567     a+  george King     george      King
2  1273421      b   gina Lucca       gina     Lucca
3  3688983    NaN          NaN       Lisa       NaN
4  3215467    NaN          NaN        Key       NaN
5  3688983    NaN          NaN       Lisa       NaN
6  3215467    NaN          NaN        Key       NaN

In [79]:
df_student.drop(index=[3,6])

        ID grade_    Full Name First Name Last Name
0  1123451      a   steven Tim     steven       Tim
1  2341567     a+  george King     george      King
2  1273421      b   gina Lucca       gina     Lucca
4  3215467    NaN          NaN        Key       NaN
5  3688983    NaN          NaN       Lisa       NaN

In [81]:
cond3 = df_student['ID']==3688983
df_student.drop(index=df_student[cond3].index)

        ID grade_    Full Name First Name Last Name
0  1123451      a   steven Tim     steven       Tim
1  2341567     a+  george King     george      King
2  1273421      b   gina Lucca       gina     Lucca
4  3215467    NaN          NaN        Key       NaN
6  3215467    NaN          NaN        Key       NaN

In [91]:
df_student.sort_values(by=['Full Name','Last Name'],ascending=False)

        ID grade_    Full Name First Name Last Name
0  1123451      a   steven Tim     steven       Tim
2  1273421      b   gina Lucca       gina     Lucca
1  2341567     a+  george King     george      King
3  3688983    NaN          NaN       Lisa       NaN
4  3215467    NaN          NaN        Key       NaN
5  3688983    NaN          NaN       Lisa       NaN
6  3215467    NaN          NaN        Key       NaN